# ConnectorManager Methods

---
The ConnectorManager type exposes the following members.
| Name| Description
---|---|---
| Dispose|
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| Lookup|  Lookup the connector using the unique index value that identify this connector.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
ConnectorManager Class
Autodesk.Revit.DB Namespace